# CannotSolveRebarWithDelayedConstraints Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..CannotSolveRebarWithDelayedConstraints Property
BuiltInFailures..::..RebarFailures Class See Also
---
There are rebar handles with invalid selected targets to constrain. The bar preview corresponds to latest valid constraints.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotSolveRebarWithDelayedConstraints { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotSolveRebarWithDelayedConstraints As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotSolveRebarWithDelayedConstraints {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace